Revit 2027 API
CurveArray.Append Method
Add the curve to the end of the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Append(
	Curve item
)
Public Overridable Sub Append (
	item As Curve
)
public:
virtual void Append(
	Curve^ item
)
abstract Append :
        item : Curve -> unit
override Append :
        item : Curve -> unit
Parameters
item Curve
The curve to be added.
See Also
Reference
CurveArray Class
Autodesk.Revit.DB Namespace